[
  {
    "id": 1,
    "name": "LuLu",
    "race": "Elfo",
    "class": "Suporte",
    "atribute": "Inteligência",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Desempenho Vitorioso",
        "description": "Aumenta a Energia de todos os Aliados em 50, alem de aplicar um buff neles que aumenta o ATQ em 20% por dois turnos.",
        "type": "Ativa"
      },
      {
        "name": "Flecha Mágica",
        "description": "O ataque normal causa 103% do ATQ em dano a todos os inimigos da fileira da frente, alem de curar o aliado com o HP mais baixo em 50% do dano causado.",
        "type": "Passiva"
      },
      {
        "name": "Fúria Interior",
        "description": "Sempre que um aliado é abatido, aumenta a energia de todos os aliados em 40. (5 vezes por batalha)",
        "type": "Passiva"
      },
      {
        "name": "Luz Reconfortante",
        "description": "No inicio da rodada 2, concede um escudo ao aliado com maior ATQ. O escudo equivale a 160% do seu ATQ e dura 3 turnos",
        "type": "Passiva"
      },
      {
        "name": "Tocador de Harpa",
        "description": "Ao ser abatida, aumenta a energia de todos os aliados em 60, alem de aplicar um biff neles que aumenta o ATQ em 15% por 2 turnos. (Uma vez por batalha)",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 2,
    "name": "Sander",
    "race": "Elfo",
    "class": "Dano",
    "atribute": "Agilidade",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Rompante Tempestuosa",
        "description": "Causa 235% do ATQ em dano a um inimigo. Adicionalmente, por 2 turnos, reduz a velocidade do inimigo em 14 e aumenta a agilidade do aliado adjacente em 14.",
        "type": "Ativa"
      },
      {
        "name": "Esquarão de Defesa Florestal",
        "description": "O ATQ do ataque normal aumenta em 35%. No final de cada rodada, você remove um debuff de si próprio e de todos aliados adjacentes a você.",
        "type": "Passiva"
      },
      {
        "name": "Cor Protetora",
        "description": "Logo antes de ser abatido, você sobrevive e se torna etéreo. A transformação etéria dura 2 turnos e você ganha 100 de energia. (Uma vez por batalha) **Durante a transformação etéria você não pode ser alvejado.",
        "type": "Passiva"
      },
      {
        "name": "Determinação Intrépida",
        "description": "Ao remover um debuff, ganha 20 de energia para cada aliado que teve um debuff removido. Ao usar uma habilidade ativa, consome toda a energia para causar dano adicional.",
        "type": "Passiva"
      },
      {
        "name": "Esquadrão de defesa Florestal",
        "description": "Perfuração +45%. Causa dano adicional equivalente a 80% da quantidade ignorada pela perfuração.",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 3,
    "name": "Aolmond",
    "race": "Elfo",
    "class": "Cura",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Coruja Lunar",
        "description": "Cura a si próprio e os aliados adjacentes em 75% do seu ATQ, além de aplicar um buff HoT, curando em 60% do seu ATQ por 3 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Liberação Espiritual",
        "description": "Ganha 100 de energia no inicio da batalha.",
        "type": "Passiva"
      },
      {
        "name": "Coração Acalentado",
        "description": "No dinal das rodadas impares, remove 2 debuffs de si e dos aliados adjacentes. Aplica um buff que aumenta a cura recebida em 20% por 1 turno.",
        "type": "Passiva"
      },
      {
        "name": "Toque Inspirador",
        "description": "No inicio de cada 2 rodadas, aplica um buff de HoT no aliado com o HP mais baixo, curando-o em 40% do seu ATQ por 2 turnos.",
        "type": "Passiva"
      },
      {
        "name": "Natureza Amplificada",
        "description": "Sempre que um aliado usa uma abilidade ativa, o valor da cura de Aolmond aumenta em 4,5%. (no maximo 15 acumulações)",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 4,
    "name": "Fiona",
    "race": "Elfo",
    "class": "Cura",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Pólen Pacífico",
        "description": "Cura o aliado com o HP mais baixo e aplica um buff de cheiro hipnótico por dois turnos. **Inimigos que atacarem aliados sob o efeito de cheio hipnótico terão 80% de chance de dormir por 2 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Ondas de Primavera",
        "description": "Perfuração +10%, Precisão +20%. Cura aliado com o HP mais baixo em 80%do dano causado com seu ataque normal.",
        "type": "Passiva"
      },
      {
        "name": "Beleza Floral",
        "description": "A habilidade ativa cura todos os aliados adicionais adjacentes ao alvo. O valor da cura adicional corresponde a 28%do valor da cura original.",
        "type": "Passiva"
      },
      {
        "name": "Cultivar",
        "description": "Atéa 5ª rodada, no inicio de cada rodada, aplica um buff aos aliados com HP abaixo de 40% aumentando a cura recebida por eles em 20% por 1 turno.",
        "type": "Passiva"
      },
      {
        "name": "Rainha das Fadas das Flores",
        "description": "A chance de um buff de Cheiro Hipnótico ocorrer aumena em 10%. No inicio de cada 3 rodadas, aplica um buff de Cheiro Hipnótico em um aliado aleatório da fileira da frente por 2 turnos. Também ganha 40 de energia sempre que um aliado for abatido",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 5,
    "name": "Abala",
    "race": "Elfo",
    "class": "Tanquer",
    "atribute": "Força",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Golpe Gigante",
        "description": "Causa 190% do ATQ em dano ao inimigo com o maior ATQ, além de aplicar um debuff de provocação por 2 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Benção da Árvore do Mundo",
        "description": "A Paratir da rodada 2, no inicio de cada 2 rodadas, você concede um escudo ao aliado com o HP mais baixo. O escudo é equivalente a 130% de seu ATQ e dura 2 turnos.",
        "type": "Passiva"
      },
      {
        "name": "Raizes Constritoras",
        "description": "Reduz o dano recebido de inimigos provocados em 55%. Ganha 50 de energia no inicio da batalha.",
        "type": "Passiva"
      },
      {
        "name": "Pele Espessa",
        "description": "Resistencia Física +10%, Perfuração +10%. No inicio de cada rodada aumenta a DEF em 8% (no maximo 5 acumulações).",
        "type": "Passiva"
      },
      {
        "name": "Mistério Ancestral",
        "description": "Ao atacar, se cura em 40% do dano causado. Esse efeito aumenta em 5% a cada rodada (max. de 75%).",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 6,
    "name": "Tania",
    "race": "Elfo",
    "class": "Dano",
    "atribute": "Agilidade",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Flecha Espinhosa",
        "description": "Causa 180% do ATQ em dano a todos os inimigos da fileira da frente.",
        "type": "Ativa"
      },
      {
        "name": "Disparo Protetor",
        "description": "Perfuração +20%, Precisão +20%. O ATQ do ataque normal aumenta em 35%. O ataque normal também aplica o debuff de enfraquecimento a criticos ao inimigo aumentando a chance de sofrer um acerto critico em 20% por 2 turnos.",
        "type": "Passiva"
      },
      {
        "name": "Especialização de Longo alcance",
        "description": "Quanto mais longe estiver o inimigo, maior o aumento do ATQ (max. de 21%).",
        "type": "Passiva"
      },
      {
        "name": "Proteção da Natureza",
        "description": "HP +12%. No inicio de cada 2 rodadas, recebe um buff que aumenta a taxa de critico em 30% por 2 turnos.",
        "type": "Passiva"
      },
      {
        "name": "Poder Absoluto",
        "description": "Taxa de Crítico +20%. Aumenta o dano crítico em 20% sempre que um ataque resultar em acerto crítico, (Max. de 3 cargas, Se nengum acero critico ocorrer, o efeito é reinicia).",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 7,
    "name": "Elara",
    "race": "Elfo",
    "class": "Suporte",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Emblema do Sol",
        "description": "Causa dano (130% do ATQ) a 1 inimigo com ATQ auto e a todos inimigos adjaentes, alem de aplicar um debuff de ofuscação aos alvos atingidos por 2 tunos. **A precisão dos inimigos sob o debuff de ofuscação diminuirá em 10%. Quando atacarem, se a precisão for menor que a taxa de esqueva do alvo o ataque irá errar e a esquiva acontecerá",
        "type": "Ativa"
      },
      {
        "name": "Esfera de Luz",
        "description": "Ataques normais causam dano (130% do ATQ) a um inimigo aleatório, aplicando um debuf de ofuscação por 1 turno.",
        "type": "Passiva"
      },
      {
        "name": "Torrente",
        "description": "Aumenta o ATQ em 5% sempre que você usar um ataque normal. (Max. de 5 cargas).",
        "type": "Passiva"
      },
      {
        "name": "Sacerdotisa do Sol",
        "description": "Ao atacar com o HO abaixo de 50%, cura a si próprio em 70% do dano causado.",
        "type": "Passiva"
      },
      {
        "name": "Juiz",
        "description": "Quando você aplica um debuff de ofuscação a inimigos que já estiveram sob o efeito da ofuscação a energia deles diminuirá em 65. Você também terá 100% de chance de aplicar choque a eles por 1 turno",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 8,
    "name": "Coco",
    "race": "Elfo",
    "class": "Suporte",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Explosão de Espíritos",
        "description": "Causa dano (140% do ATQ) a 1 inimigo e todos os inimigos adjacentes e remove 1 buff",
        "type": "Ativa"
      },
      {
        "name": "Ajuda da Fada",
        "description": "Aumenta o ATQ de ataques normais em 30%. Além disso, ao atacar inimigos com defessa superior a sua, o ataque ATQ aumenta em 16%",
        "type": "Passiva"
      },
      {
        "name": "Graça da Proteção",
        "description": "Quando o HP dos aliados que estão na mesma fileira cair abaixo de 60%, aplica o buff graça da proteção por 2 turnos. (3 vezes por batalha) **Aliados com graça da proteção não receberão dano superior a 20%do HP máximo em um unico ataque.",
        "type": "Passiva"
      },
      {
        "name": "Poder da Vida",
        "description": "Quando o HP cair abaixo de 50%, aplica HoT em si mesmo e recupera 80% do ATQ por 2 turnos. (Uma vez por batalha)",
        "type": "Passiva"
      },
      {
        "name": "Sentinela Mágica",
        "description": "Toda vez que um aliado morrer, reduz 100 de energia e aplica o debuff Silenciamento por 1 turno.",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 9,
    "name": "Babu",
    "race": "Elfo",
    "class": "Tanquer",
    "atribute": "Força",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Colisão Violenta",
        "description": "Causa 130% do ATQ em dano a 1 inimigo e atodos os inimigos adjacentes, além de se curar em 100% de todo o dano causado.",
        "type": "Ativa"
      },
      {
        "name": "Abalo Sísmico",
        "description": "Aumenta o ATQ do ataque normal em 50%, ao usar o ataque normal, aumenta a DEF e a DEF Crit. em 8% (max. 5 acúmulos).",
        "type": "Passiva"
      },
      {
        "name": "Insígnia de Proteção",
        "description": "HP +10%. Cura a si próprio em 115% do dano causado pelo seu ataque normal.",
        "type": "Passiva"
      },
      {
        "name": "Sacerdotisa do Sol",
        "description": "Ao atacar com o HO abaixo de 50%, cura a si próprio em 70% do dano causado.",
        "type": "Passiva"
      },
      {
        "name": "Punição Cruel",
        "description": "Ao ser atingido por um golpe crítico você atordoa o inimigo atacante por 1 turno e ganha 50 de energia adicional. (5 vezes por batalha)",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 10,
    "name": "Oneiric",
    "race": "Elfo",
    "class": "Dano",
    "atribute": "Agilidade",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Rugido do Espírito",
        "description": "Causa 150% do ATQ em dano a todos os inimigos na fileira de trás e reduz a energia deles em 40",
        "type": "Ativa"
      },
      {
        "name": "Orbe da Escuridão",
        "description": "Ataques normais causam 120% do ATQ em dano ao inimigo mais próximo na fileira de trás e remove 1 buff.",
        "type": "Passiva"
      },
      {
        "name": "Rastro de Morte",
        "description": "Aumenta o ATQ em 25% contra inimifos com menos de 50%do HP, além de curar em 25% do dano causado aos inimigos com menos de 50% do HP.",
        "type": "Passiva"
      },
      {
        "name": "Saciedade",
        "description": "Cada vez que o Orbe da Escuridão ou o Banquete do Espírito remove um buff de um inimigo, aumenta o ATQ em 4% para cada buff removido.",
        "type": "Passiva"
      },
      {
        "name": "Banquete do Espírito",
        "description": "No inicio de cada rodada, causa 120% do ATQ em dano a todos os inimigos com menos de 50% de HP, além de remover 1 buff.",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 11,
    "name": "Galan",
    "race": "Elfo",
    "class": "Suporte",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Tornado do Deserto",
        "description": "Causa 110% do ATQ em dano ao inimigo mais próximo na fileira de trás e a todos a todos os inimigos adjacentes a ele , além de ter 55% de chance de aplicar Tempestade de areia por um turno",
        "type": "Ativa"
      },
      {
        "name": "Vento Confinante",
        "description": "HP +15%. O ataque normal causa 120% do ATQ em dano ao inimigo mais próximo na fileira de trás.",
        "type": "Passiva"
      },
      {
        "name": "Fervor Oculto",
        "description": "Resistencia Mágica +10% DEF Crit. +10%. NO inicio de cada 2 rodadas, reduz a energia do inimigo mais próximo na fileira de trás em 25.",
        "type": "Passiva"
      },
      {
        "name": "Relutância",
        "description": "Aumenta o ATQ em 12% para cada inimigo sob o efeito de Tempestade de Areia.",
        "type": "Passiva"
      },
      {
        "name": "Guardião da Natureza",
        "description": "Aumenta a chance da Tempestade de Areia em 10%. Também aumenta o ATQ de uma habilidade ativada em 20%",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 12,
    "name": "Calix",
    "race": "Humano",
    "class": "Suporte",
    "atribute": "Agilidade",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Pancada Perfurante",
        "description": "Causa 145% do ATQ em dano a 1 inimigo e atodos os inimigos em uma linha reta atrás dele aplicando um debuff que reduz a DEF em 40%por 2 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Golpe Inevitável",
        "description": "DEF +10%, DEF Crit. +25%. O ataque normal causa 100% do ATQ em dano a 1 inimigo e aos inimigos adjacentes atrás dele.",
        "type": "Passiva"
      },
      {
        "name": "Cavaleiro Guardião",
        "description": "Ao ser atacado, há 100% de chance de aumentar a Energia do aliado com o maior ATQ em 50. (No maximo 1 vez por rodada)",
        "type": "Passiva"
      },
      {
        "name": "Habilidade de  Sobrevivencia ",
        "description": "No inicio de cada 4 rodadas, cura 50% do HP max.",
        "type": "Passiva"
      },
      {
        "name": "Cavaleiro Honroso",
        "description": "No inicio de cada duas rodadas, aumenta a energia de si próprio e do aliado com o maior ATQ em 40. Sempre que for ativado esse efeito aumenta em 5. (no max. 50)",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 13,
    "name": "Odelia",
    "race": "Humano",
    "class": "Cura",
    "atribute": "Inteligência",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Prece da Recuperação",
        "description": "Cura o aliado com o HP mais baixo  em 300% do ATQ e remove 2 debuffs.",
        "type": "Ativa"
      },
      {
        "name": "Poder Divino",
        "description": "Aumenta o ATQ dos ataques normais em 30%. Se o alvo estiver com o HP acima de 70%, atordoa o alvo por 1 turno.",
        "type": "Passiva"
      },
      {
        "name": "Aura de Feitiçaria",
        "description": "<span>Resistencia a controle +100%.</span> Quando o HP estiver abaixo de 50%, reduz o dano recebido em 23%",
        "type": "Passiva"
      },
      {
        "name": "Proteção Divina",
        "description": "100% do excesso de cura é convertido em um escudo por 2 turnos. Aumenta a cura em 30% no inicio da batalha, esse efeito diminui em 5% a cada rodada.",
        "type": "Passiva"
      },
      {
        "name": "Caminho de Penitência",
        "description": "Ao usar uma habilidade ativa, revive um aliado abatido 1x com 65% de HP e 50% de energia. Esse efeito dura apenas até o final da 6 rodada (1 vez por batalha).",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 14,
    "name": "Milia",
    "race": "Humano",
    "class": "Dano",
    "atribute": "Agilidade",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Golpe de Misericórdia",
        "description": "Causa 230% do ATQ em dano ao inimigo com HP mais baixo. Quando uma habilidade ativa causa um acerto crítico ganha um buff que aumenta o dano crítico em 20% por 3 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Disparo Preciso",
        "description": "O ataque normal causa 145% do ATQ de dano ao inimigo com HP mais baixo.",
        "type": "Passiva"
      },
      {
        "name": "Ferida Mortal",
        "description": "<span>Taxa de Crítico +11%</span> Ao conseguir um acerto crítico, cura a si próprio em 40% do dano causado.",
        "type": "Passiva"
      },
      {
        "name": "Santuário de Deus",
        "description": "Aumenta a taxa de crítico em 10% para cada aliado adjacente vivo.",
        "type": "Passiva"
      },
      {
        "name": "Força Irrefreável",
        "description": "Se você abater um inimigo com sua habilidade ativa, ataca mais uma vez, Esse ataque possui 17% de redução de ATQ.",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 15,
    "name": "Richelle",
    "race": "Humano",
    "class": "Tanquer",
    "atribute": "Força",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Proteção Imperial",
        "description": "Concede um escudo a si próprio e a todos os aliados adjacentes a você. O escudo equivale a 23%do HP max de Richelle por 2 turnos.",
        "type": "Ativa"
      },
      {
        "name": "Medida Drástica",
        "description": "Você e todos os aliados adjacentes a você não recebem dano de um único ataque que eceder 35% de seu HP máximo até a 3ª rodada.",
        "type": "Passiva"
      },
      {
        "name": "Comando Desalmado",
        "description": "Ao ser atacado ganha 5 de energia adcional. Ao usar um escudo você remove 1 debuff de cada aliado.",
        "type": "Passiva"
      },
      {
        "name": "Reversão",
        "description": "Até a rodada 5, no inicio de cada rodada, se o HP estiver abaixo de 40%, cura a si próprio em 25% de seu HP máximo.",
        "type": "Passiva"
      },
      {
        "name": "Disciplina Militar Rigorosa",
        "description": "Logo antes de ser abatido, Sobrevive e ganha um escudo de imunidade a dano por 1 turno. Se for abatido após isso, concede um escudo a todos os aliados adjacentes . O escudo equivale a 25% do HP máximo de Richelle e dura 2 turnos. (Uma vez por batalha)",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 16,
    "name": "Rakan",
    "race": "Humano",
    "class": "Tanker",
    "atribute": "Força",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Ataque Avassalador",
        "description": "Causa 210% do ATQ em dano a 1 inimigo e concede um escudo a si próprio por 2 turnos. O escudo é equivalente a 90% do dano causado.",
        "type": "Ativa"
      },
      {
        "name": "Guerreiro Mais Forte",
        "description": "Quando seu HP estiver acima de 50%, aumenta a DEF em 30%. Quando seu HP estiver abaixo de 50%, aumenta o ATQ em 30%.",
        "type": "Passiva"
      },
      {
        "name": "Espírito Ferido",
        "description": "<span>Taxa de Esquiva +40%</span> Ao ser abatido, aplica um debuff de silenciamento por 1 turno a todos os inimigos com 40 ou mais de energia (uma vez por batalha).",
        "type": "Passiva"
      },
      {
        "name": "Raiva Ensandecida",
        "description": "Ao final de cada 2 rodadas, remove 2 debuffs de si próprio e de todos os aliados na mesma fileira. Ao remover um debuff se cura em 20% do HP máximo (uma vez por rodada).",
        "type": "Passiva"
      },
      {
        "name": "Ascensão",
        "description": "Ao ser abatido, reduz a energia de todos os inimigos em 60, alem de aplicar um debuff que aumenta o dano recebido em 28% por 2 turnos (2 vezes por combate).",
        "type": "Passiva"
      }
    ]
  },
  {
    "id": 17,
    "name": "Idina",
    "race": "Humano",
    "class": "Suporte",
    "atribute": "Inteligencia",
    "rarity": "Épico",
    "skills": [
      {
        "name": "Barreira de Gelo",
        "description": "Causa 100% do ATQ em dano a todos os inimigos na fileira de trás, com 65% de chance de congelá-los por 1 turno.",
        "type": "Ativa"
      },
      {
        "name": "Cristal de Gelo",
        "description": "<span>HP +12%</span> O ataque normal causa 83% do ATQ em dano a todos os inimigos na fileira de trás.",
        "type": "Passiva"
      },
      {
        "name": "Rainha do Gelo",
        "description": "Ao ser atacado cum um golpe mágico, ganha 25 de energia adicional.",
        "type": "Passiva"
      },
      {
        "name": "Congelado",
        "description": "<span>Resistencia Magica +10%</span> Se o seu HP ficar abaixo de 30% ou 70%, congela o inimigo atacante por 1 turno (uma vez por batalha).",
        "type": "Passiva"
      },
      {
        "name": "Aperto Gélido",
        "description": "No inicio de cada 3 rodadas, congela 1 inimigo aleatório da fileira de trás por 1 turno e reduz a energia dele em 30.",
        "type": "Passiva"
      }
    ]
  }

]